; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	spectrograph1 - mode
	infrared0 - mode
	Star3 - direction
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	Star6 - direction
	Star5 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star6)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star5)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet13)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation8)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star6)
	(supports instrument10 spectrograph1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation4)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation2)
	(calibration_target instrument11 Star1)
	(supports instrument12 spectrograph1)
	(calibration_target instrument12 GroundStation8)
	(calibration_target instrument12 GroundStation4)
	(calibration_target instrument12 Star7)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon11)
	(supports instrument13 spectrograph1)
	(supports instrument13 infrared0)
	(calibration_target instrument13 Star6)
	(supports instrument14 spectrograph1)
	(supports instrument14 infrared0)
	(calibration_target instrument14 Star5)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite4 Star3)
	(pointing satellite6 Star6)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 infrared0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 infrared0)
	(have_image Planet13 spectrograph1)
	(have_image Star14 infrared0)
	(have_image Phenomenon15 spectrograph1)
))

)

; plan
1. (turn_to satellite6 star6 phenomenon11)
   deleted: (pointing satellite6 phenomenon11)
   added: (pointing satellite6 star6)
   goals met: 1 of 10
2. (turn_to satellite4 star3 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star3)
   goals met: 2 of 10
3. (turn_to satellite1 star0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star0)
   goals met: 3 of 10
4. (turn_to satellite0 groundstation8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 10
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
6. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 3 of 10
7. (turn_to satellite0 phenomenon9 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 10
8. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 10
9. (turn_to satellite0 phenomenon15 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 10
10. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 5 of 10
11. (turn_to satellite0 phenomenon11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 10
12. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 6 of 10
13. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 6 of 10
14. (take_image satellite0 planet12 instrument0 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 7 of 10
15. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 7 of 10
16. (take_image satellite0 planet13 instrument0 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 8 of 10
17. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 8 of 10
18. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 9 of 10
19. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 9 of 10
20. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 10 of 10
